#! /usr/bin/env python
import dislin


# Координаты точек в 3D-пространстве для сфер и концов соединений
x = [10., 20., 10., 20., 5., 15., 25., 5., 15., 25., 
      5., 15., 25., 10., 20., 10., 20.]
y = [10., 10., 20., 20., 5., 5., 5., 15., 15., 15.,
      25., 25., 25., 10., 10., 20., 20.]
z = [5., 5., 5., 5., 15., 15., 15., 15., 15., 15.,
    15., 15., 15., 25., 25., 25., 25.]  

# Индексы пар точек, которые будут соединены связи (каждые два числа - индексы начала и конца соединения)
idx = [1, 2, 1, 3, 3, 4, 2, 4, 5, 6, 6, 7, 8, 9, 9, 10,
      11, 12, 12, 13,  5, 8, 8, 11, 6, 9, 9, 12, 7, 10,
      10, 13,  14, 15, 16, 17, 14, 16, 15, 17,
       1, 5, 2, 7, 3, 11, 4, 13, 5, 14, 7, 15, 11, 16, 13, 17]

# Установка формата страницы А4 В портретной ориентации
dislin.setpag ('da4p')
# Режим отображения: белый на черном (Фон)
dislin.scrmod ('revers') # 'norev' 'auto' 'revers'
# Вывод
dislin.metafl ('pdf') # 'pdf' 'png' 'cons'
# Инициализация DISLIN
dislin.disini ()
# Рисование рамки вокруг страницы
dislin.pagera ()
# Использование аппаратных шрифтов
dislin.hwfont ()
# Включение освещения для 3D-объектов
dislin.light ('on')
# Настройка материала: слабое зеркальное отражение
dislin.matop3 (0.02, 0.02, 0.02, 'diffuse') # 'diffuse' 'ambient' 'specular' 'emission'

# Отключение отсечения в 3D
dislin.clip3d ('none')
# Позиция и размер системы координат
dislin.axspos (0, 2500)
dislin.axslen (2100, 2100)

# Высота заголовка и сам заголовок графика
dislin.htitle (50)
dislin.titlin ('Spheres and Tubes', 4)

# Подписи осей
dislin.name ('X-axis', 'x')
dislin.name ('Y-axis', 'y')
dislin.name ('Z-axis', 'z')

# Автоматическое определение количества цифр в метках осей
dislin.labdig (-1, 'xyz')
# Горизонтальное расположение меток осей
dislin.labl3d ('hori')
# Определение диапазонов осей: X(0-30), Y(0-30), Z(0-30) с шагом 5
dislin.graf3d (0., 30., 0., 5., 0., 30., 0., 5., 0., 30., 0., 5.)
# Отображение заголовка
dislin.title ()

# 'smooth' 'flat' 'none' / 'surface' 'lines' 'border'
# Режим сглаженного затенения поверхностей
dislin.shdmod ('smooth', 'surface')

# Начало записи в Z-буфер (для правильного отображения 3D)
iret = dislin.zbfini()
# Настройка красного диффузного материала
dislin.matop3 (1.0, 0.0, 0.0, 'diffuse')
# Создание 17 красных сфер радиусом 2.0 с 50x25
for i in range (0, 17):
      dislin.sphe3d (x[i], y[i], z[i], 2.0, 50, 25)
      

# Настройка 2 диффузного материала
dislin.matop3 (0.0, 1.0, 0.0, 'diffuse')

"""
Создание 28 зеленых труб:
j - индекс начала пары в списке idx
j1, j2 - индексы точек (с поправкой на нумерацию с 0)
Трубы радиусом 0.5 с 5 сегментами по окружности
"""
for i in range (0, 28):
  j = 2 * i
  j1 = idx[j] - 1
  j2 = idx[j+1] - 1
  dislin.tube3d (x[j1], y[j1], z[j1], 
                 x[j2], y[j2], z[j2], 0.5, 50, 50) 

# Завершение работы с Z-буфером
dislin.zbffin ()

# Завершение работы с DISLIN
dislin.disfin ()
